<h3>Pandas Series</h3>

In [1]:
import numpy as np
import pandas as pd

In [2]:
list=["Ahmad","20","married","Programmer"]
labels=["name","age","status","profession"]
numpyList=np.array(list)
dictionary={"name":"Ahmad","age":20,"status":"married","profession":"Programmer"}

In [4]:
pd.Series(list,index=labels)

name               Ahmad
age                   20
status           married
profession    Programmer
dtype: object

In [6]:
pd.Series(numpyList,labels)

name               Ahmad
age                   20
status           married
profession    Programmer
dtype: object

In [7]:
pd.Series(dictionary)

name               Ahmad
age                   20
status           married
profession    Programmer
dtype: object

<h3>Pandas DataFrame</h3>

They have one labels and multiple series

In [10]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}

In [11]:
pd.DataFrame(data)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [12]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
coloumn=["Name","Age","City","Salary"]

<h3>Showing the Data using Dataframe</h3>

In [14]:
pd.DataFrame(data_list)

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [20]:
df1=pd.DataFrame(data_list,columns=coloumn)
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [19]:
df1["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [22]:
df1[["Name","City"]]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [23]:
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

<h3>Creating the Dataframe</h3>

In [25]:
df1["Designation"]=["Norway","Germany","Pakistan","London"]

In [26]:
df1

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Norway
1   Anna   34     Paris   70000     Germany
2  Peter   29    Berlin   62000    Pakistan
3  Linda   42    London   85000      London

In [30]:
df1[["Designation","City"]]

  Designation      City
0      Norway  New York
1     Germany     Paris
2    Pakistan    Berlin
3      London    London

In [35]:
# here by default axis is set 0 what do you mean by axis here axis=0 refer to row and axis=1 refer to coloumn or attributes
df1.drop("Designation",axis=1)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [34]:
df1

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Norway
1   Anna   34     Paris   70000     Germany
2  Peter   29    Berlin   62000    Pakistan
3  Linda   42    London   85000      London

So you have to come to know that we try to delete the "Designation" column but its only print the snapshot not actually delete from the RAM or disk. But we can delete it using a parameter called inplace

In [38]:
df1.drop("Designation",axis=1,inplace=True)

In [39]:
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

<h3>Selecting the rows</h3>

In [41]:
df1.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [46]:
df1.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

In [47]:
df1.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [50]:
df1.loc[:][["City","Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000
2    Berlin   62000
3    London   85000

In [51]:
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [52]:
df1.loc[[2,3]][["Name","Age"]]

    Name  Age
2  Peter   29
3  Linda   42

In [53]:
df1[df1["Age"]>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [54]:
df1[(df1["Age"]>30) & (df1["City"]=="Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000

The End